Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.UnqualifiedWallTypeError Property
 Stacked walls and curtain walls cannot maintain hosted relationships with other walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnqualifiedWallTypeError { get; }
Public Shared ReadOnly Property UnqualifiedWallTypeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnqualifiedWallTypeError {
	FailureDefinitionId^ get ();
}
static member UnqualifiedWallTypeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace